src/cf/DataProcessors/вогРотацияАссортимента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<DataProcessor>
		<Properties>
			<Name>вогРотацияАссортимента</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>АртикулыНаСтендах</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Стенд</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.вогСтенды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сторона</Name>
							<Type>
								<v8:Type>cfg:EnumRef.вогСтороныСтендов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АртикулДоИзменения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтенда</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Позиция</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/вогНастройкиРасстановкиСтендаВБрендЗоне.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>вогНастройкиРасстановкиСтендаВБрендЗоне</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Позиция</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/DataProcessors/вогРотацияАссортимента/Forms/ФормаНастроек/Ext/Form/Module.bsl
&НаКлиенте
Процедура Выбрать(Команда)
	
	Если Элементы.СписокНаименований.ТекущиеДанные <> Неопределено Тогда
		ПараметрыЗакрытия = Новый Структура("НаименованиеНастройки",Элементы.СписокНаименований.ТекущиеДанные.Значение);
		Закрыть(ПараметрыЗакрытия);
	Иначе
		Сообщить("Настройка не выбрана");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСписокНаименований();
	
	Если Параметры.Свойство("Сохранение") И Параметры.Сохранение Тогда
		ЭтаФорма.Заголовок = "Сохранение настроек";
		Элементы.СписокНаименований.Заголовок = "Ранее сохраненные настройки";
		Элементы.ФормаВыбрать.Видимость = Ложь;
		Элементы.ФормаЗаписать.КнопкаПоУмолчанию = Истина;
		Сохранение = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("Выбор") И Параметры.Выбор Тогда
		ЭтаФорма.Заголовок = "Выбор настроек";
		Элементы.ФормаЗаписать.Видимость = Ложь;
		Элементы.СписокНаименований.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		Элементы.НаименованиеНастройки.Видимость = Ложь;
		Выбор = Истина;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокНаименований()
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	вогНастройкиРасстановкиСтендаВБрендЗоне.ИмяНастройки КАК ИмяНастройки
		|ИЗ
		|	РегистрСведений.вогНастройкиРасстановкиСтендаВБрендЗоне КАК вогНастройкиРасстановкиСтендаВБрендЗоне
		|ГДЕ
		|	вогНастройкиРасстановкиСтендаВБрендЗоне.Пользователь = &Пользователь
		|
		|СГРУППИРОВАТЬ ПО
		|	вогНастройкиРасстановкиСтендаВБрендЗоне.ИмяНастройки";
	
	Запрос.УстановитьПараметр("Пользователь", ТекущийПользователь);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	СписокНаименований.ЗагрузитьЗначения(РезультатЗапроса.ВыгрузитьКолонку("ИмяНастройки"));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНастройку(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		НаименованиеПовторяется = ПроверитьНаименованиеНаДубль(НаименованиеНастройки);
		Если НаименованиеПовторяется Тогда 
			ПоказатьВопрос(Новый ОписаниеОповещения("ЗаписатьНастройкуЗавершение", ЭтотОбъект), "Наименование настройки совпадает с существующей. Данные будут перезаписаны. Продолжить?",РежимДиалогаВопрос.ДаНет);
		Иначе
			ПараметрыЗакрытия = Новый Структура("НаименованиеНастройки",НаименованиеНастройки);
			Закрыть(ПараметрыЗакрытия);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНастройкуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ПараметрыЗакрытия = Новый Структура("НаименованиеНастройки",НаименованиеНастройки);
		Закрыть(ПараметрыЗакрытия);
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьНаименованиеНаДубль(ИмяНастройки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	вогНастройкиРасстановкиСтендаВБрендЗоне.ИмяНастройки КАК ИмяНастройки
		|ИЗ
		|	РегистрСведений.вогНастройкиРасстановкиСтендаВБрендЗоне КАК вогНастройкиРасстановкиСтендаВБрендЗоне
		|ГДЕ
		|	вогНастройкиРасстановкиСтендаВБрендЗоне.Пользователь = &Пользователь
		|	И вогНастройкиРасстановкиСтендаВБрендЗоне.ИмяНастройки = &ИмяНастройки
		|
		|СГРУППИРОВАТЬ ПО
		|	вогНастройкиРасстановкиСтендаВБрендЗоне.ИмяНастройки";
	
	Запрос.УстановитьПараметр("ИмяНастройки", ИмяНастройки);
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СписокНаименованийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		НаименованиеНастройки = Элемент.ТекущиеДанные.Значение;
	КонецЕсли;
	
КонецПроцедуры
